skywalkw3r/sensecap-indicator-ha/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.x Project Minimal Configuration


CONFIG_IDF_TARGET="esp32s3"


CONFIG_IDF_EXPERIMENTAL_FEATURES=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_120M=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y


CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# CONFIG_ESP32S3_DATA_CACHE_64KB=y
# CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
# CONFIG_ESP_IPC_TASK_STACK_SIZE=4096

# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_SLEEP_FLASH_LEAKAGE_WORKAROUND=n
# CONFIG_ESP_SLEEP_PSRAM_LEAKAGE_WORKAROUND=n
# CONFIG_ESP_PHY_REDUCE_TX_POWER=y

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000


CONFIG_FREERTOS_HZ=1000
# CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y


# --- Display render pipeline (full rationale: docs/render-pipeline.md) -------
# SHIPPING DEFAULT -- Profile A: avoid-tearing + full refresh.
# LVGL re-renders the whole 480x480 frame into one of the RGB panel's two
# PSRAM framebuffers each frame, then swaps. Simple and artifact-free; the
# per-frame render cost is constant no matter how little actually changed.
# Verified on hardware -- do NOT flip these two lines without an on-hardware
# A/B pass with the perf monitor (see below).
CONFIG_LCD_AVOID_TEAR=y
CONFIG_LCD_LVGL_FULL_REFRESH=y
CONFIG_LCD_TASK_REFRESH_TIME=10
CONFIG_LV_DEF_REFR_PERIOD=10

# --- Alternate render profiles (DEV A/B only -- keep commented for release) --
# LCD_LVGL_FULL_REFRESH and LCD_LVGL_DIRECT_MODE are a Kconfig `choice`
# (components/bsp/Kconfig.projbuild): exactly ONE may be selected, and both
# depend on LCD_AVOID_TEAR=y. To try Profile B, comment out the
# CONFIG_LCD_LVGL_FULL_REFRESH line above AND uncomment the line below.
#
# Profile B -- direct mode: LVGL renders only the invalidated areas (replayed
# across both framebuffers over two frames) instead of the whole screen.
# Expected to lift FPS / cut CPU for small partial updates (clock ticks,
# toggles, arc/slider nudges); no faster than full refresh for full-screen
# repaints. Best match for the "animate small objects" UI-overhaul direction.
# CONFIG_LCD_LVGL_DIRECT_MODE=y
#
# Profile C -- dual-core software rendering (composes with A or B): spread each
# frame's rasterization across both ESP32-S3 cores using two LVGL SW draw
# units. LV_DRAW_SW_DRAW_UNIT_CNT > 1 REQUIRES an OS abstraction -- LVGL emits
# a hard #error otherwise (managed_components/lvgl__lvgl/src/draw/sw/
# lv_draw_sw.c:33) -- so LV_OS_FREERTOS must be set alongside it. Gains are
# likely MODEST on this board: both framebuffers live in shared Octal PSRAM,
# so full-frame draws are bound by PSRAM write bandwidth, not CPU cycles.
# Helps most on gradient/opacity-heavy frames or partial (Profile B) updates.
# Costs ~2x LV_DRAW_THREAD_STACK_SIZE (default 8 KB) of internal RAM for the
# worker task stacks. esp_lvgl_port is agnostic to draw-unit count (it owns
# its own lock and never references LV_USE_OS), so this is config-only.
# CONFIG_LV_OS_FREERTOS=y
# CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2


# CONFIG_LV_CONF_MINIMAL=y
# LVGL 9: route lv_malloc() to the C library heap (ESP heap incl. PSRAM).
# The former CONFIG_LV_MEM_CUSTOM=y was an LVGL 8 option with no effect on
# LVGL 9, which silently fell back to the built-in TLSF allocator and its
# 64 KB static pool. Composite-layer draw buffers (forced by any translucent
# widget) exceed that pool, and the draw dispatcher live-locks retrying the
# failed allocation: taskLVGL spins, IDLE1 starves, task_wdt fires forever.
CONFIG_LV_USE_CLIB_MALLOC=y
# CONFIG_LV_MEMCPY_MEMSET_STD=y
# CONFIG_LV_USE_ASSERT_NULL=y
# CONFIG_LV_USE_ASSERT_MALLOC=y
# --- Perf monitor (DEV-ONLY -- flip OFF for release) -------------------------
# On-screen FPS + CPU-usage overlay used to A/B the render profiles above.
# LV_USE_PERF_MONITOR depends on LV_USE_SYSMON in the LVGL Kconfig, so BOTH
# must be set or the perf symbol is silently dropped. Overlay lands bottom-
# right by default. Uncomment LOG_MODE to also stream FPS/CPU over serial
# (./dev monitor) for exact numbers. See docs/render-pipeline.md.
# (LV_USE_MEM_MONITOR is intentionally NOT enabled: it needs LV_USE_BUILTIN_
# MALLOC, but this firmware routes lv_malloc to the C-library/PSRAM heap.)
CONFIG_LV_USE_SYSMON=y
CONFIG_LV_USE_PERF_MONITOR=y
# CONFIG_LV_USE_PERF_MONITOR_LOG_MODE=y
CONFIG_LV_COLOR_SCREEN_TRANSP=y

CONFIG_LV_FONT_UNSCII_8=n
CONFIG_LV_TXT_ENC_UTF8=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

CONFIG_LV_FONT_MONTSERRAT_8=y
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_34=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_38=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_42=y
CONFIG_LV_FONT_MONTSERRAT_44=y
CONFIG_LV_FONT_MONTSERRAT_46=y
CONFIG_LV_FONT_MONTSERRAT_48=y

CONFIG_LV_SPRINTF_USE_FLOAT=y


# TLS capability for MQTT (feat: mqtts:// support).
# These only PERMIT the runtime "setmqtt --insecure" opt-out of server
# verification; the runtime default remains full verification (stored CA
# via setmqttca, else the public certificate bundle).
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
